package main

import (
	"fmt"
)

func main()  {
	//TODO 数组的排序
	//内部排序 交换式排序法 选择式排序法 插入式排序法
	fmt.Println("============================ 交换排序-冒泡排序 ============================")
	//冒泡排序：前面的数和后面的数比较，前面的数大，则交换
	//     [24, 69, 80, 57, 13]
	// ==== 第一轮
	//1 => [24, 69, 80, 57, 13]
	//2 => [24, 69, 80, 57, 13]
	//3 => [24, 69, 57, 80, 13]
	//4 => [24, 69, 57, 13, 80]
	// ==== 第二轮
	//1 => [24, 69, 57, 13, 80]
	//2 => [24, 57, 69, 13, 80]
	//3 => [24, 57, 13, 69, 80]
	// ==== 第三轮
	//1 => [24, 57, 13, 69, 80]
	//2 => [24, 13, 57, 69, 80]
	// ==== 第四轮
	//1 => [13, 24, 57, 69, 80]
	arr01 := [...]int{24, 69, 80, 57, 13}
	fmt.Println("排序前=", arr01)
	for ceng := 0; ceng < len(arr01) - 1; ceng++ {
		for i := 0; i < len(arr01) - ceng - 1; i++ {
			// fmt.Println("i=", i)
			if arr01[i] > arr01[i + 1] {
				temp := arr01[i + 1]
				arr01[i + 1] = arr01[i]
				arr01[i] = temp
			}
			fmt.Printf("第%v轮第%v次排序=%v \n", ceng+1, i+1, arr01)
		}
	}
	fmt.Println("排序后=", arr01)


	//外部排序 合并排序法和直接合并排序法

}